DataProcessors/ТТМ_АРМ_ПроцессСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТТМ_АРМ_ПроцессСогласования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиМенеджер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТМ_СтатусыПроверокПроцессСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиКонструктор</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТМ_СтатусыПроверокПроцессСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПроизводства</Name>
					<Type>
						<v8:Type>d7p1:FlowchartContextType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОтчета</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеОбновлениеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпецификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
					<Comment>Выбор списка исполнителей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыСОтказом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованоМенеджер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованоКонструктор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованоСнабжение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОтбораЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяЦена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ТТМ_АРМ_ПроцессСогласования/Forms/ФормаЗаказовСОтказом/Ext/Form/Module.bsl
#Область ФормаВыбораЗаказовСОтказомОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыгруженныйСписок = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	Объект.ЗаказыСОтказом.Очистить();
	
	Для Каждого ТекДанные Из ВыгруженныйСписок Цикл
		НоваяСтрока = Объект.ЗаказыСОтказом.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
	КонецЦикла;
	
	Объект.Ответственный = Параметры.Ответственный;	
	ВызовИзФормыМенеджера = Параметры.ФормаПодразделения.ФормаМенеджеров;
	ВызовИзФормыКонструктора = Параметры.ФормаПодразделения.ФормаКонструкторов;
	ВызовИзФормыСнабжения = Параметры.ФормаПодразделения.ФормаСнабжения;		
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждитьИзменения(Команда)
	РезультатыВыбора = ОбработкаИзФормыВыбораЗаказовСОтказом();
	ОчиститьСообщения();
	
	Если ВызовИзФормыМенеджера Тогда
		Оповестить("ПослеВыбораЗаказаСОтказомМенеджер", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВызовИзФормыКонструктора Тогда
		Если РезультатыВыбора.ЗаказПолностьюЗакрыт Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'В списке выбран заказ, который полностью закрыт. Вернуть закрытый заказ доступен менеджеру!'"),, "Объект.ЗаказыСОтказом");
		    Возврат;
		КонецЕсли;
		
		Оповестить("ПослеВыбораЗаказаСОтказомКонструктор", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВызовИзФормыСнабжения Тогда
		Если РезультатыВыбора.ЗаказПолностьюЗакрыт Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'В списке выбран заказ, который полностью закрыт. Вернуть закрытый заказ доступен менеджеру!'"),, "Объект.ЗаказыСОтказом");
		    Возврат;
		КонецЕсли;

		Оповестить("ПослеВыбораЗаказаСОтказомКонструктор", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработкаИзФормыВыбораЗаказовСОтказом()	
	МассивНайденныхСтрок = Объект.ЗаказыСОтказом.НайтиСтроки(Новый Структура("Выбрано", Истина));
	МассивЗаказовСОтказом = Новый Массив;
	ЗаказПолностьюЗакрыт = Ложь;
	
	Для Каждого ТекДанные Из МассивНайденныхСтрок Цикл 
		МассивЗаказовСОтказом.Добавить(ТекДанные.ЗаказКлиента);
	КонецЦикла;
	
	Для Каждого ЗаказОбработки Из МассивЗаказовСОтказом Цикл
		Если ЗаказОбработки.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
			ЗаказПолностьюЗакрыт = Истина;
		КонецЕсли;
	КонецЦикла;
	
	РезультатыВыбора = Новый Структура;
	РезультатыВыбора.Вставить("МассивЗаказовСОтказом", МассивЗаказовСОтказом);
	РезультатыВыбора.Вставить("ЗаказПолностьюЗакрыт", ЗаказПолностьюЗакрыт);
	
	Возврат РезультатыВыбора;	
КонецФункции

#КонецОбласти
